print(type("안녕하세요"))
print(type(111))

print("안녕하세요")
print('안녕하세요')

# print(""안녕하세요"라고 말했습니다.")

print('"안녕하세요"라고 말했습니다.')
print("'배가 고픕니다'라고 생각했습니다.")


print("\"안녕하세요\"라고 말했습니다.")
print('\'배가 고픕니다\'라고 생각했습니다.')

print("안녕하세요\n반가워요!")
print("안녕하세요\t\t\t반가워요!")

print("이름\t나이\t지역")
print("영희\t20\t서울")
print("길동\t30\t인천")
print("철수\t40\t청주")

print("\\")

print("동해물과 백두산이 마르고 닳도록\n하느님이 보우하사 우리나라만세\n무궁화 삼천리 화려강산 대한사람\n대한으로 길이 보전하세")
print("""
동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라만세
무궁화 삼천리 화려강산 대한사람
대한으로 길이 보전하세
""")
print("줄바꿈??")


print("""\
동해물과 백두산이 마르고 닳도록
하느님이 보우하사 우리나라만세
무궁화 삼천리 화려강산 대한사람
대한으로 길이 보전하세\
""")
print("줄바꿈??")

print("안녕" + "하세요")
print("안녕하세요" + "!")
print("안녕","하세요")
# print("안녕하세요" + 1)

print("1+1=",1+1)
print("1*1=",1*1)

print()
print("문자열 반복\n" * 3)

print()
print(3 * "문자열 반복\n")

print("문자 선택 연산자에 대해 알아볼까요?")
print("안녕하세요"[0])
print("안녕하세요"[1])
print("안녕하세요"[2])
print("안녕하세요"[3])
print("안녕하세요"[4])
# print("안녕하세요"[5])

print()
print("안녕하세요"[-1])
print("안녕하세요"[-2])
print("안녕하세요"[-3])
print("안녕하세요"[-4])
print("안녕하세요"[-5])

print("함수이용")
str = "안녕하세요"
r = reversed(str)
print(''.join(r))

print("안녕하세요"[::-1])

print()
print("안녕하세요"[1:4])
print("안녕하세요"[1:5])
print("안녕하세요"[0:4])
print("안녕하세요"[0:5])

print()
print("안녕하세요"[0:2])
print("안녕하세요"[1:3])
print("안녕하세요"[2:4])

print()
print("안녕하세요"[1:])
print("안녕하세요"[:3])

print()
print("------")
hello = "안녕하세요"
print(hello[0:2])

print(hello)

print()
# print("안녕하세요"[5])

print()
print("안녕하세요 문자열의 길이는?" ,len("안녕하세요"))


print()
print("# 연습문제")
print("\\\\\\\\")
print("-" * 8 )

print()
print("안녕하세요"[1]) #녕
print("안녕하세요"[2]) #하
print("안녕하세요"[3]) #세
print("안녕하세요"[4]) #요
#print("안녕하세요"[5]) #에러 발생

print()
print("안녕하세요"[1:3]) #녕하
print("안녕하세요"[2:4]) #하세
print("안녕하세요"[1:])  #녕하세요
print("안녕하세요"[:3])  #안녕